In [1]:
mysql://scott:tiger@mysql:3306/default

In [9]:
select * from movies limit 5;

,movie,title,title_eng,year,grade
0,10001,시네마 천국,"Cinema Paradiso , 1988",2013,전체 관람가
1,10002,빽 투 더 퓨쳐,"Back To The Future , 1985",2015,12세 관람가
2,10003,빽 투 더 퓨쳐 2,"Back To The Future Part 2 , 1989",2015,12세 관람가
3,10004,빽 투 더 퓨쳐 3,"Back To The Future Part III , 1990",1990,전체 관람가
4,10005,스타워즈 에피소드 4 - 새로운 희망,"Star Wars , 1977",1997,PG

In [10]:
select movie, title from movies limit 5;

,movie,title
0,10001,시네마 천국
1,10002,빽 투 더 퓨쳐
2,10003,빽 투 더 퓨쳐 2
3,10004,빽 투 더 퓨쳐 3
4,10005,스타워즈 에피소드 4 - 새로운 희망

In [11]:
select title from movies where title = '시네마 천국';

,title
0,시네마 천국

In [13]:
select * from movies where title like '%%스타%%';

,movie,title,title_eng,year,grade
0,10005,스타워즈 에피소드 4 - 새로운 희망,"Star Wars , 1977",1997.0,PG
1,10006,스타워즈 에피소드 5 - 제국의 역습,"Star Wars Episode V: The Empire Strikes Back , 1980",1997.0,PG
2,10007,스타워즈 에피소드 6 - 제다이의 귀환,"Star Wars: Episode VI: Return Of The Jedi , 1983",1997.0,PG
3,10074,스타 트랙,"Star Trek: The Motion Picture , 1979",NaN,G
4,10075,스타 트랙 2 - 칸의 분노,"Star Trek II: The Wrath Of Khan , 1982",NaN,PG
5,10076,스타 트랙 3 - 스포크를 찾아서,"Star Trek III: The Search For Spock , 1984",NaN,PG
6,10077,스타 트랙 4 - 귀환의 항로,"Star Trek IV: The Voyage Home , 1986",NaN,12세 관람가
7,10078,스타 트랙 5 - 최후의 결전,"Star Trek V: The Final Frontier , 1989",NaN,PG
8,10079,스타 트랙 6 - 미지의 세계,"Star Trek VI: The Undiscovered Country , 1991",NaN,PG
9,10127,스타 탄생,"A Star Is Born , 1976",1977.0,NR
10,10174,지저스 크라이스트 슈퍼스타,"Jesus Christ Superstar , 1973",NaN,G
11,10373,스타 이즈 본 디 오리지널,"A Star Is Born , 1937",NaN,12세 관람가
12,10374,스타 탄생,"A Star Is Born , 1954",NaN,PG
13,10443,실베스타 스텔론의 탈옥,"Lock Up , 1989",1989.0,12세 관람가
14,10477,아나스타샤,"Anastasia: The Mystery Of Anna , 1986",NaN,15세 관람가

In [14]:
select * from movies where year > 2000 limit 5;

,movie,title,title_eng,year,grade
0,10001,시네마 천국,"Cinema Paradiso , 1988",2013,전체 관람가
1,10002,빽 투 더 퓨쳐,"Back To The Future , 1985",2015,12세 관람가
2,10003,빽 투 더 퓨쳐 2,"Back To The Future Part 2 , 1989",2015,12세 관람가
3,10015,타워링,"The Towering Inferno , 1974",2012,PG
4,10018,이티,"The Extra-Terrestrial , E.T. , 1982",2011,전체 관람가

In [15]:
select * from movies where year > 2000 and year < 2010  limit 5;

,movie,title,title_eng,year,grade
0,10065,엑소시스트,"The Exorcist , 1973",2001,15세 관람가
1,10153,로보트 태권V,"Robot Taekwon V , 1976",2007,전체 관람가
2,10208,자유부인,"自由夫人 , Madame Freedom , 1956",2004,12세 관람가
3,10242,더티 댄싱,"Dirty Dancing , 1987",2007,15세 관람가
4,10329,스카페이스,"Scarface , 1932",2006,15세 관람가

In [16]:
select * from movies where year < 2000 or year > 2010  limit 5;

,movie,title,title_eng,year,grade
0,10001,시네마 천국,"Cinema Paradiso , 1988",2013,전체 관람가
1,10002,빽 투 더 퓨쳐,"Back To The Future , 1985",2015,12세 관람가
2,10003,빽 투 더 퓨쳐 2,"Back To The Future Part 2 , 1989",2015,12세 관람가
3,10004,빽 투 더 퓨쳐 3,"Back To The Future Part III , 1990",1990,전체 관람가
4,10005,스타워즈 에피소드 4 - 새로운 희망,"Star Wars , 1977",1997,PG

In [17]:
select year, title from movies where year between 2000 and 2022 order by year asc limit 5;

,year,title
0,2000,마지막 전투
1,2001,엑소시스트
2,2002,그리스도 최후의 유혹
3,2003,야수의 최후
4,2004,천금을 마다한 사나이

In [18]:
select year, title from movies where year in (2013, 2015, 2019) limit 5;

,year,title
0,2013,시네마 천국
1,2015,빽 투 더 퓨쳐
2,2015,빽 투 더 퓨쳐 2
3,2019,벤허
4,2019,미션

In [24]:
select year, title from movies order by year desc limit 5;

,year,title
0,2020,졸업
1,2019,블러드 심플
2,2019,벤허
3,2019,차타레 부인의 사랑
4,2019,쉘부르의 우산

In [25]:
select year, title from movies where year is not null order by year asc limit 5;

,year,title
0,1926,아리랑
1,1927,낙화유수
2,1940,수업료
3,1946,우리 집의 낙원
4,1946,위대한 지그펠드

In [26]:
select title as 한글제목, title_eng as 영문제목, year as 년도, grade as 등급 from movies limit 1;

,한글제목,영문제목,년도,등급
0,시네마 천국,"Cinema Paradiso , 1988",2013,전체 관람가

In [30]:
select rate/10 as 원본, ROUND(rate/10) as 반올림, CEIL(rate/10) as 올림, FLOOR(rate/10) as 버림 
from rates 
where movie = 10096 and rate in (4, 5, 6, 10) limit 10

,원본,반올림,올림,버림
0,0.5,1.0,1,0
1,1.0,1.0,1,1
2,0.5,1.0,1,0
3,0.5,1.0,1,0
4,0.5,1.0,1,0
5,1.0,1.0,1,1
6,1.0,1.0,1,1
7,1.0,1.0,1,1
8,0.4,0.0,1,0
9,0.4,0.0,1,0

In [31]:
select rate as 원본, rate - 10 as 음수, ABS(rate - 10) as 음수절대값, rate + 10 as 양수, ABS(rate + 10) as 양수절대값 
from rates where movie = 10096 and rate in (4, 5, 6, 10) limit 10

,원본,음수,음수절대값,양수,양수절대값
0,5,-5,5,15,15
1,10,0,0,20,20
2,5,-5,5,15,15
3,5,-5,5,15,15
4,5,-5,5,15,15
5,10,0,0,20,20
6,10,0,0,20,20
7,10,0,0,20,20
8,4,-6,6,14,14
9,4,-6,6,14,14

In [32]:
select MIN(rate), MAX(rate), COUNT(rate), SUM(rate), AVG(rate) from rates;

,MIN(rate),MAX(rate),COUNT(rate),SUM(rate),AVG(rate)
0,1,10,140710,1259813.0,8.9533

In [33]:
select original, UCASE(original), LCASE(original) from peoples limit 5;

,original,UCASE(original),LCASE(original)
0,Adam Baldwin,ADAM BALDWIN,adam baldwin
1,Adrian Lyne,ADRIAN LYNE,adrian lyne
2,Aidan Quinn,AIDAN QUINN,aidan quinn
3,Akira Kurosawa,AKIRA KUROSAWA,akira kurosawa
4,Al Pacino,AL PACINO,al pacino

In [34]:
select korean, original, CONCAT(korean, ' @ ', original) from peoples limit 5;

,korean,original,"CONCAT(korean, ' @ ', original)"
0,아담 볼드윈,Adam Baldwin,아담 볼드윈 @ Adam Baldwin
1,애드리안 라인,Adrian Lyne,애드리안 라인 @ Adrian Lyne
2,에이단 퀸,Aidan Quinn,에이단 퀸 @ Aidan Quinn
3,구로사와 아키라,Akira Kurosawa,구로사와 아키라 @ Akira Kurosawa
4,알 파치노,Al Pacino,알 파치노 @ Al Pacino

In [35]:
select title_eng, RIGHT(title_eng, 4), year, SUBSTR(year, 3, 2) from movies limit 5;

,title_eng,"RIGHT(title_eng, 4)",year,"SUBSTR(year, 3, 2)"
0,"Cinema Paradiso , 1988",1988,2013,13
1,"Back To The Future , 1985",1985,2015,15
2,"Back To The Future Part 2 , 1989",1989,2015,15
3,"Back To The Future Part III , 1990",1990,1990,90
4,"Star Wars , 1977",1977,1997,97

In [36]:
select title, LENGTH(title), CHAR_LENGTH(title) from movies limit 5;

,title,LENGTH(title),CHAR_LENGTH(title)
0,시네마 천국,16,6
1,빽 투 더 퓨쳐,18,8
2,빽 투 더 퓨쳐 2,20,10
3,빽 투 더 퓨쳐 3,20,10
4,스타워즈 에피소드 4 - 새로운 희망,46,20

In [37]:
select korean, REPLACE(korean, '구로사와', '쿠로사와'), INSTR(korean, '아키라'), original, INSTR(original, 'Akira') 
from peoples where people = 13;

,korean,"REPLACE(korean, '구로사와', '쿠로사와')","INSTR(korean, '아키라')",original,"INSTR(original, 'Akira')"
0,구로사와 아키라,쿠로사와 아키라,6,Akira Kurosawa,1

In [38]:
select CURDATE(), CURTIME(), NOW()

,CURDATE(),CURTIME(),NOW()
0,2022-06-19,0 days 20:47:28,2022-06-19 20:47:28

In [39]:
select DATE('2021-06-18'), TIME('20:56:00')

,DATE('2021-06-18'),TIME('20:56:00')
0,2021-06-18,0 days 20:56:00

In [40]:
select now(), year(now()), month(now()), monthname(now()), weekday(now()), dayname(now()), dayofmonth(now()), day(now())

,now(),year(now()),month(now()),monthname(now()),weekday(now()),dayname(now()),dayofmonth(now()),day(now())
0,2022-06-19 20:47:44,2022,6,June,6,Sunday,19,19

In [42]:
select timestamp, YEAR(timestamp), MONTH(timestamp), MONTHNAME(timestamp), WEEKDAY(timestamp), DAYNAME(timestamp), DAY(timestamp)
from rates limit 5;

,timestamp,YEAR(timestamp),MONTH(timestamp),MONTHNAME(timestamp),WEEKDAY(timestamp),DAYNAME(timestamp),DAY(timestamp)
0,2017-05-07 12:34:00,2017,5,May,6,Sunday,7
1,2016-07-03 16:10:00,2016,7,July,6,Sunday,3
2,2017-12-15 22:22:00,2017,12,December,4,Friday,15
3,2015-02-21 14:53:00,2015,2,February,5,Saturday,21
4,2015-03-29 20:09:00,2015,3,March,6,Sunday,29

In [43]:
SELECT NOW(), HOUR(NOW()), MINUTE(NOW()), SECOND(NOW())

,NOW(),HOUR(NOW()),MINUTE(NOW()),SECOND(NOW())
0,2022-06-19 20:48:35,20,48,35

In [44]:
select ADDDATE(NOW(), INTERVAL 1 YEAR)
, ADDDATE(NOW(), INTERVAL -1 MONTH)
, ADDDATE(NOW(), INTERVAL 1 WEEK)
, ADDDATE(NOW(), INTERVAL -1 DAY)
, ADDDATE(NOW(), INTERVAL 1 MINUTE)
, ADDDATE(NOW(), INTERVAL -1 SECOND)

,"ADDDATE(NOW(), INTERVAL 1 YEAR)","ADDDATE(NOW(), INTERVAL -1 MONTH)","ADDDATE(NOW(), INTERVAL 1 WEEK)","ADDDATE(NOW(), INTERVAL -1 DAY)","ADDDATE(NOW(), INTERVAL 1 MINUTE)","ADDDATE(NOW(), INTERVAL -1 SECOND)"
0,2023-06-19 20:48:42,2022-05-19 20:48:42,2022-06-26 20:48:42,2022-06-18 20:48:42,2022-06-19 20:49:42,2022-06-19 20:48:41

In [45]:
select NOW(), timestamp, DATEDIFF(NOW(), timestamp) from rates limit 5;

,NOW(),timestamp,"DATEDIFF(NOW(), timestamp)"
0,2022-06-19 20:48:51,2017-05-07 12:34:00,1869
1,2022-06-19 20:48:51,2016-07-03 16:10:00,2177
2,2022-06-19 20:48:51,2017-12-15 22:22:00,1647
3,2022-06-19 20:48:51,2015-02-21 14:53:00,2675
4,2022-06-19 20:48:51,2015-03-29 20:09:00,2639

In [46]:
select TIMEDIFF('2022-06-20 16:20:00', '2022-06-18 16:35:00');

,"TIMEDIFF('2022-06-20 16:20:00', '2022-06-18 16:35:00')"
0,1 days 23:45:00

In [48]:
select DATE_FORMAT(NOW(), '%%Y년 %%m월 %%d일 %%p %%h시 %%i분 %%s초')

,"DATE_FORMAT(NOW(), '%Y년 %m월 %d일 %p %h시 %i분 %s초')"
0,2022년 06월 19일 PM 08시 49분 17초

In [49]:
select MONTH(NOW()), IF (MONTH(NOW()) <= 6, '전반기', '후반기') as 전후반기

,MONTH(NOW()),전후반기
0,6,전반기

In [50]:
select year, IFNULL(year, 1970) from movies limit 20;

,year,"IFNULL(year, 1970)"
0,2013.0,2013
1,2015.0,2015
2,2015.0,2015
3,1990.0,1990
4,1997.0,1997
5,1997.0,1997
6,1997.0,1997
7,1979.0,1979
8,1981.0,1981
9,NaN,1970
10,1990.0,1990
11,1988.0,1988
12,1977.0,1977
13,1992.0,1992
14,2012.0,2012
15,1991.0,1991
16,1956.0,1956
17,2011.0,2011
18,1970.0,1970
19,1995.0,1995

In [51]:
select year, COUNT(*) as cnt from movies group by year order by cnt desc limit 10

,year,cnt
0,NaN,390
1,1990.0,72
2,1989.0,53
3,1991.0,42
4,1987.0,35
5,1992.0,29
6,1988.0,27
7,1986.0,26
8,1985.0,23
9,2015.0,23

In [52]:
select movie, MIN(rate), MAX(rate), SUM(rate), COUNT(rate), AVG(rate), SUM(rate) / COUNT(rate) 
from rates where movie in (10001, 10002) group by movie

,movie,MIN(rate),MAX(rate),SUM(rate),COUNT(rate),AVG(rate),SUM(rate) / COUNT(rate)
0,10001,1,10,33785.0,3635,9.2944,9.2944
1,10002,1,10,28288.0,3004,9.4168,9.4168

In [53]:
select genre, count(genre) from genres group by genre

,genre,count(genre)
0,드라마,529
1,멜로/로맨스,172
2,SF,80
3,코미디,233
4,서부,31
5,판타지,55
6,모험,117
7,액션,211
8,가족,40
9,스릴러,162
10,범죄,117
11,공포,79
12,전쟁,75
13,미스터리,48
14,뮤지컬,41
15,느와르,15
16,애니메이션,6
17,서사,1
18,에로,10
19,다큐멘터리,3

In [54]:
select year, count(*) as cnt from movies group by year WITH ROLLUP

,year,cnt
0,NaN,390
1,1926.0,1
2,1927.0,1
3,1940.0,1
4,1946.0,3
5,1948.0,2
6,1952.0,3
7,1953.0,1
8,1954.0,5
9,1955.0,6
10,1956.0,3
11,1957.0,8
12,1958.0,2
13,1959.0,2
14,1960.0,3
15,1961.0,6
16,1962.0,4
17,1964.0,2
18,1965.0,1
19,1966.0,4
20,1967.0,1
21,1968.0,2
22,1969.0,3
23,1970.0,5
24,1971.0,5
25,1972.0,3
26,1973.0,3
27,1974.0,3
28,1975.0,4
29,1976.0,5
30,1977.0,13
31,1978.0,9
32,1979.0,16
33,1980.0,10
34,1981.0,10
35,1982.0,11
36,1983.0,13
37,1984.0,13
38,1985.0,23
39,1986.0,26
40,1987.0,35
41,1988.0,27
42,1989.0,53
43,1990.0,72
44,1991.0,42
45,1992.0,29
46,1993.0,9
47,1994.0,4
48,1995.0,2
49,1996.0,2
50,1997.0,4
51,1998.0,1
52,1999.0,3
53,2000.0,1
54,2001.0,1
55,2002.0,1
56,2003.0,1
57,2004.0,4
58,2005.0,1
59,2006.0,1
60,2007.0,2
61,2009.0,1
62,2010.0,2
63,2011.0,1
64,2012.0,5
65,2013.0,4
66,2014.0,8
67,2015.0,23
68,2016.0,12
69,2017.0,8
70,2018.0,5
71,2019.0,8
72,2020.0,1
73,NaN,999

In [55]:
select year, count(*) as cnt from movies group by year HAVING year is not null order by year asc limit 10

,year,cnt
0,1926,1
1,1927,1
2,1940,1
3,1946,3
4,1948,2
5,1952,3
6,1953,1
7,1954,5
8,1955,6
9,1956,3

In [56]:
select DISTINCT genre from genres

,genre
0,드라마
1,멜로/로맨스
2,SF
3,코미디
4,서부
5,판타지
6,모험
7,액션
8,가족
9,스릴러
10,범죄
11,공포
12,전쟁
13,미스터리
14,뮤지컬
15,느와르
16,애니메이션
17,서사
18,에로
19,다큐멘터리

In [58]:
select title from movies where movie in (
    select movie from genres where genre = 'SF'
) limit 5

,title
0,빽 투 더 퓨쳐
1,빽 투 더 퓨쳐 2
2,빽 투 더 퓨쳐 3
3,스타워즈 에피소드 4 - 새로운 희망
4,스타워즈 에피소드 5 - 제국의 역습

In [59]:
select title from movies where movie = any (
    select movie from genres where genre = 'SF'
) limit 5

,title
0,빽 투 더 퓨쳐
1,빽 투 더 퓨쳐 2
2,빽 투 더 퓨쳐 3
3,스타워즈 에피소드 4 - 새로운 희망
4,스타워즈 에피소드 5 - 제국의 역습

In [60]:
select movie, title, year, grade, (

    select count(*) from countries c
    where c.movie = m.movie
) as num_country, (

    select avg(rate) from rates r
    where r.movie = m.movie
) as avg_rate, (

    select count(people) from castings s
    where s.movie = m.movie
) as num_people

from movies m limit 5

,movie,title,year,grade,num_country,avg_rate,num_people
0,10001,시네마 천국,2013,전체 관람가,2,9.2944,16
1,10002,빽 투 더 퓨쳐,2015,12세 관람가,1,9.4168,8
2,10003,빽 투 더 퓨쳐 2,2015,12세 관람가,1,9.2710,10
3,10004,빽 투 더 퓨쳐 3,1990,전체 관람가,1,9.1200,12
4,10005,스타워즈 에피소드 4 - 새로운 희망,1997,PG,1,9.0486,5

In [61]:
select * from movies limit 5;

,movie,title,title_eng,year,grade
0,10001,시네마 천국,"Cinema Paradiso , 1988",2013,전체 관람가
1,10002,빽 투 더 퓨쳐,"Back To The Future , 1985",2015,12세 관람가
2,10003,빽 투 더 퓨쳐 2,"Back To The Future Part 2 , 1989",2015,12세 관람가
3,10004,빽 투 더 퓨쳐 3,"Back To The Future Part III , 1990",1990,전체 관람가
4,10005,스타워즈 에피소드 4 - 새로운 희망,"Star Wars , 1977",1997,PG

In [62]:
select * from castings where `leading` = 1 and `order` = 1 limit 5;

,movie,people,order,leading
0,10001,4374,1,1
1,10002,1076,1,1
2,10003,1076,1,1
3,10004,1076,1,1
4,10005,1007,1,1

In [63]:
select count(*) from movies m join castings c on m.movie = c.movie and `leading` = 1 and `order` = 1;

,count(*)
0,988

In [64]:
select m1.movie, m1.title, m2.movie as next_movie, m2.title as next_title 
from movies m1 join movies m2 on m1.movie + 1 = m2.movie limit 5

,movie,title,next_movie,next_title
0,10001,시네마 천국,10002,빽 투 더 퓨쳐
1,10002,빽 투 더 퓨쳐,10003,빽 투 더 퓨쳐 2
2,10003,빽 투 더 퓨쳐 2,10004,빽 투 더 퓨쳐 3
3,10004,빽 투 더 퓨쳐 3,10005,스타워즈 에피소드 4 - 새로운 희망
4,10005,스타워즈 에피소드 4 - 새로운 희망,10006,스타워즈 에피소드 5 - 제국의 역습

In [65]:
-- left outer join 이므로 왼쪽 테이블(movies)의 갯수만큼 조회 됩니다
select count(*) from movies m left outer join castings c 
on m.movie = c.movie and c.`leading` = 1 and c.`order` = 1

,count(*)
0,999

In [66]:
select movie, title, title_eng from movies where title_eng like '%%Super%%'
union
select movie, title, title_eng from movies where title_eng like '%%Superman%%'

,movie,title,title_eng
0,10008,슈퍼맨,"Superman , 1978"
1,10009,슈퍼맨 2,"Superman II , 1980"
2,10010,슈퍼맨 3,"Superman III , 1983"
3,10011,슈퍼맨 4 - 최강의 적,"Superman IV: The Quest For Peace , 1987"
4,10174,지저스 크라이스트 슈퍼스타,"Jesus Christ Superstar , 1973"

In [67]:
select movie, title, title_eng from movies where title_eng like '%%Super%%'
union all
select movie, title, title_eng from movies where title_eng like '%%Superman%%'

,movie,title,title_eng
0,10008,슈퍼맨,"Superman , 1978"
1,10009,슈퍼맨 2,"Superman II , 1980"
2,10010,슈퍼맨 3,"Superman III , 1983"
3,10011,슈퍼맨 4 - 최강의 적,"Superman IV: The Quest For Peace , 1987"
4,10174,지저스 크라이스트 슈퍼스타,"Jesus Christ Superstar , 1973"
5,10008,슈퍼맨,"Superman , 1978"
6,10009,슈퍼맨 2,"Superman II , 1980"
7,10010,슈퍼맨 3,"Superman III , 1983"
8,10011,슈퍼맨 4 - 최강의 적,"Superman IV: The Quest For Peace , 1987"

In [76]:
DROP TABLE netflix_movies

In [77]:

CREATE TABLE IF NOT EXISTS netflix_movies (
	movie bigint, 
	title varchar(50), 
	year int, 
	genre varchar(30), 
	country varchar(50)
) ;

In [78]:
INSERT INTO netflix_movies (movie, title, year, genre, country) 
VALUES (20000, '모가디슈', 2021, '액션 드라마', '미국');

In [79]:
INSERT INTO netflix_movies VALUES (20001, '싱글라이더', 2016, '미스터리 판타지', '미국');

In [80]:
INSERT INTO netflix_movies VALUES (20002, '아수라', 2016, '범죄 액션', '미국');

In [90]:
select * from netflix_movies

In [82]:
UPDATE netflix_movies SET country = '한국' WHERE movie = 20000 ;

In [84]:
UPDATE netflix_movies SET country = '한국' ;

In [86]:
-- 모든 데이터를 삭제
DELETE FROM netflix_movies ;

In [87]:
-- 한 번에 여러 레코드를 콤마로 구분하여 삽입
INSERT INTO netflix_movies VALUES 
(20000, '모가디슈', 2021, '액션 드라마', '미국'),
(20001, '싱글라이더', 2016, '미스터리 판타지', '미국'), 
(20002, '아수라', 2016, '범죄 액션', '미국');

In [89]:
TRUNCATE netflix_movies ;

In [91]:
create table if not exists foo (d1 decimal(65,0), d2 decimal(65,30));

In [97]:
insert into foo (d2) values (123456789012345678901234567890.12345678901234567890123456789012345678901234);

In [96]:
insert into foo (d2) values (567890123456789012345678901234567890.123456789012345678901234567890);

In [98]:
insert into foo (d2) values (123467890123456789012345678901234567890);

In [99]:
CREATE table netflix_kor_movies (
    movie int, 
    title varchar(50), 
    year int, 
    jenre varchar(30), 
    description varchar(100)
) ;

In [101]:
DROP TABLE IF EXISTS netflix_movies ;

In [102]:
ALTER TABLE netflix_kor_movies 
RENAME TO netflix_movies ;

In [104]:
show tables

,Tables_in_default
0,castings
1,countries
2,foo
3,genres
4,movies
5,netflix_movies
6,peoples
7,purchase_20201025
8,purchase_20201026
9,rates
10,seoul_popular_trip
11,user_20201025
12,user_20201026

In [105]:
ALTER TABLE netflix_movies 
CHANGE jenre genre varchar(30) ;

In [107]:
ALTER TABLE netflix_movies 
DROP COLUMN description ;

In [108]:
ALTER TABLE netflix_movies 
ADD COLUMN country varchar(50) ;

In [109]:
DROP table netflix_movies ;

In [110]:
CREATE TABLE IF NOT EXISTS netflix_movies (
    movie bigint AUTO_INCREMENT PRIMARY KEY,
    title varchar(50) NOT NULL,
    year int DEFAULT 1970, 
    genre varchar(30), 
    country varchar(50) DEFAULT '한국'
) ;

In [111]:
ALTER TABLE netflix_movies AUTO_INCREMENT=20000;

In [113]:
INSERT INTO netflix_movies (title, year, genre) VALUES
('모가디슈', 2021, '액션 드라마'),
('싱글라이더', 2016, '미스터리 판타지'),
('아수라', 2016, '범죄 액션');

In [114]:
SELECT * FROM netflix_movies

,movie,title,year,genre,country
0,20000,모가디슈,2021,액션 드라마,한국
1,20001,싱글라이더,2016,미스터리 판타지,한국
2,20002,아수라,2016,범죄 액션,한국